# Semana 29
Crear un archivo `pandas_dataframe.ipynb` con un mini DataFrame de **10 registros propios**.

In [1]:
import pandas as pd

In [6]:
#Mini Data frame

Base = {"Nombre": ["Maria", "Pablo", "Juan", "Carlos", "Sergio", "Link", "Mario Bros", "Maria Magdalena", "Patricio Estrella", "Calamardo"]
      , "Edad" : [22, 30, 23, 12, 45, 90,10, 50, 16, 29]
      , "Ingreso en miles": [10, 4, 12, 60, 29, 38,29,13,15, 10]}
df = pd.DataFrame (Base)
df

              Nombre  Edad  Ingreso en miles
0              Maria    22                10
1              Pablo    30                 4
2               Juan    23                12
3             Carlos    12                60
4             Sergio    45                29
5               Link    90                38
6         Mario Bros    10                29
7    Maria Magdalena    50                13
8  Patricio Estrella    16                15
9          Calamardo    29                10

In [10]:
df[df["Ingreso en miles"] > 10]

              Nombre  Edad  Ingreso en miles
2               Juan    23                12
3             Carlos    12                60
4             Sergio    45                29
5               Link    90                38
6         Mario Bros    10                29
7    Maria Magdalena    50                13
8  Patricio Estrella    16                15